import re, os, sys

def restore_aclink(data):
	data = re.sub(r'<a href="(?!http)([^"]+?)#([^"]*?)__BODY">(.*?)</a>', 
		r'<ac:link ac:anchor="\2"><ri:page ri:content-title="\1" /><ac:link-body>\3</ac:link-body></ac:link>', data) 

	data = re.sub(r'<a href="(?!http)([^"]+?)#([^"]*?)__DATA">(.*?)</a>', 
		r'<ac:link ac:anchor="\2"><ri:page ri:content-title="\1" /><ac:plain-text-link-body><![CDATA[\3]]></ac:plain-text-link-body></ac:link>', data) 

	data = re.sub(r'<a href="#([^"]*?)__DATA">(.*?)</a>', 
		r'<ac:link ac:anchor="\1"><ac:plain-text-link-body><![CDATA[\2]]></ac:plain-text-link-body></ac:link>', data) 

	data = re.sub(r'<a href="(?!http)([^"]+?)__BODY">(.*?)</a>', 
		r'<ac:link><ri:page ri:content-title="\1" /><ac:link-body>\2</ac:link-body></ac:link>', data)	

	data = re.sub(r'<a href="(?!http)([^"]+?)__LSFUS__DATA">(.*?)</a>', 
		r'<ac:link><ri:page ri:space-key="LSFUS" ri:content-title="\1" /><ac:plain-text-link-body><![CDATA[\2]]></ac:plain-text-link-body></ac:link>', data)	

	data = re.sub(r'<a href="(?!http)([^"]+?)__DATA">(.*?)</a>', 
		r'<ac:link><ri:page ri:content-title="\1" /><ac:plain-text-link-body><![CDATA[\2]]></ac:plain-text-link-body></ac:link>', data)	

	data = re.sub(r'<a href="(?!http)([^"]+?)__LSFUS">(.*?)</a>', 
		r'<ac:link><ri:page ri:space-key="LSFUS" ri:content-title="\1" /></ac:link>', data)	

	data = re.sub(r'<a href="(?!http)([^"]+?)">(.*?)</a>', 
		r'<ac:link><ri:page ri:content-title="\1" /><ac:plain-text-link-body><![CDATA[\2]]></ac:plain-text-link-body></ac:link>', data)	
	
	return data	

def fix_nbsp(data):
	return re.sub(r'&nbsp([^;])', r'&nbsp;\1', data) 

def fix_newlines_in_codeblock(data):
	pos = 0
	out_data = ''
	find_pos = re.search(r'<ac:plain-text-body><!\[CDATA\[((?!<\/ac:plain-text-body>).)*\\n.*<\/ac:plain-text-body>', data[pos:])
	while find_pos is not None:
		prefix = '<ac:plain-text-body><![CDATA['
		next_start_pos = pos + find_pos.start() 	
		out_data += data[pos:next_start_pos]
		out_data += prefix
		pos = next_start_pos + len(prefix)
		opened = 1
		while opened > 0:
			if data[pos] == '[':
				opened += 1
			elif data[pos] == ']':
				opened -= 1

			if data[pos] == '\\':
				if data[pos+1] == 'n':
					out_data += '\n'
				if data[pos+1] == 't':
					out_data += '\t'
				if data[pos+1] == '\\':
					out_data += '\\'
				pos += 1
			else:
				out_data += data[pos]			
			pos += 1

		find_pos = re.search(r'<ac:plain-text-body><!\[CDATA\[((?!<\/ac:plain-text-body>).)*\\n.*<\/ac:plain-text-body>', data[pos:])

	out_data += data[pos:]
	return out_data

def fix_external_links(data):
	pos = 0
	out_data = ''
	titles_by_id = titles()
	match = re.search(r'<a[^>]* href="https?://documentation\.lsfusion\.org/pages/viewpage\.action\?pageId=(\d+)(#[^"]*)?"[^>]*>(((?!</a>).)*)</a>', data[pos:])
	# <ac:link><ri:page ri:content-title="text" /><ac:plain-text-link-body><![CDATA[text]]></ac:plain-text-link-body></ac:link>
	# <ac:link ac:anchor="text"><ri:page ri:content-title="text" /><ac:plain-text-link-body><![CDATA[text]]></ac:plain-text-link-body></ac:link>
	while match is not None:
		id = match.group(1)
		if id in titles_by_id:
			anchor = match.group(2)
			text = match.group(3)
			next_start_pos = pos + match.start() 	
			out_data += data[pos:next_start_pos]
			if anchor is not None:
				out_data += f'<ac:link ac:anchor="{anchor[1:]}"><ri:page ri:content-title="{titles_by_id[id]}" /><ac:link-body>{text}</ac:link-body></ac:link>'
			else:	
				out_data += f'<ac:link><ri:page ri:content-title="{titles_by_id[id]}" /><ac:link-body>{text}</ac:link-body></ac:link>'
		else:
			print(f'{id}\n')
			out_data += data[pos:pos+match.end()] 		
		pos = pos + match.end()
		match = re.search(r'<a[^>]* href="https?://documentation\.lsfusion\.org/pages/viewpage\.action\?pageId=(\d+)(#[^"]*)?"[^>]*>(((?!</a>).)*)</a>', data[pos:])

	out_data += data[pos:]
	return out_data

def restore(dir, outdir):
	if not os.path.exists(outdir):
		os.makedirs(outdir)

	for filename in os.listdir(dir): 
		data = ''
		with open(dir + '/' + filename, 'r', encoding='utf-8') as infile:
		    data = infile.read()
		    data = restore_aclink(data)	
		    data = fix_nbsp(data)
		    data = fix_newlines_in_codeblock(data)	
		    data = fix_external_links(data)

		with open(outdir + '/' + filename, 'w', encoding='utf-8') as outfile:
			outfile.write(data)


def titles():
	titles_by_id = {
		"36307222": "How-to",
		"36307288": "How-to: CASE/IF/OVERRIDE",
		"36307463": "How-to: CHANGE",
		"36307387": "How-to: CRUD",
		"46367046": "How-to: DELETE",
		"46367032": "How-to: EXEC",
		"46367060": "How-to: FOR",
		"65241375": "How-to: FORMULA",
		"36307275": "How-to: GROUP CONCAT",
		"36307263": "How-to: GROUP LAST",
		"36307252": "How-to: GROUP MAX/MIN/AGGR",
		"36307226": "How-to: GROUP SUM",
		"36307385": "How-to: GUI",
		"46367066": "How-to: IF/CASE",
		"65241390": "How-to: INTERNAL",
		"46367038": "How-to: NEW",
		"46367128": "How-to: NEWSESSION",
		"36307305": "How-to: PARTITION",
		"46367774": "How-to: SEEK",
		"46367478": "How-to: Use Cases",
		"46367071": "How-to: WHILE",
		"36307461": "How-to: Ввод данных",
		"55935068": "How-to: Взаимодействие через HTTP-протокол",
		"36307224": "How-to: Вычисления",
		"36307459": "How-to: Действия",
		"65241529": "How-to: Декларативная логика",
		"46367457": "How-to: Деревья",
		"36307439": "How-to: Дизайн",
		"36307399": "How-to: Документы со строками",
		"36307455": "How-to: Императивная логика",
		"46367614": "How-to: Импорт данных",
		"57738152": "How-to: Интеграция",
		"60555450": "How-to: Интерактивные формы",
		"60555378": "How-to: Интернационализация",
		"46367544": "How-to: Матрица",
		"46367754": "How-to: Метапрограммирование",
		"46367463": "How-to: Навигатор",
		"65241436": "How-to: Наследование и агрегации",
		"46367528": "How-to: Нумерация",
		"65241544": "How-to: Обращение к внутренним системам",
		"46367200": "How-to: Ограничения",
		"46367627": "How-to: Отчеты",
		"46367603": "How-to: Переопределение значений",
		"65241522": "How-to: Поиск элементов",
		"60555394": "How-to: Пространства имен",
		"60555456": "How-to: Работа с внешними форматами",
		"46367481": "How-to: Работа с документами",
		"43647197": "How-to: Расширение действий",
		"43647151": "How-to: Расширение классов",
		"43647195": "How-to: Расширение свойств",
		"43647629": "How-to: Расширение форм",
		"46367169": "How-to: Расширения",
		"46367505": "How-to: Регистры",
		"57737819": "How-to: Связывание свойств",
		"46367179": "How-to: События",
		"46367563": "How-to: Создание на основе",
		"46367766": "How-to: Состояние таблиц",
		"52429887": "How-to: Физическая модель",
		"36307423": "How-to: Фильтрация и сортировка",
		"60555410": "How-to: Фронтенд",
		"57738034": "How-to: Экспорт данных",
		"65241514": "How-to: Явная типизация",
		"46367442": "IDE",
		"60555505": "Автоматическая установка",
		"4161551": "Агрегации",
		"35520957": "Активация (ACTIVATE)",
		"35520955": "Активность (ACTIVE)",
		"32474741": "Арифметические операторы",
		"1572894": "Арифметические операторы (+, -, *, ...)",
		"13008898": "Блок описания события",
		"3866665": "Блок свойств и действий",
		"3866696": "Блок событий",
		"3866658": "Блоки объектов",
		"3866671": "Блоки фильтров и сортировок",
		"36307331": "В интерактивном представлении (SHOW, DIALOG)",
		"57737722": "В печатном представлении (PRINT)",
		"57737720": "В структурированном представлении (EXPORT, IMPORT)",
		"35520941": "Ввод значения",
		"35520943": "Ввод примитива (INPUT)",
		"5275770": "Ветвление (CASE, IF, MULTI)",
		"5275763": "Взаимодействие с пользователем / ИС",
		"6684739": "Внутренний вызов (INTERNAL)",
		"2031657": "Встроенные классы",
		"1572905": "Выбор (CASE, IF, MULTI, OVERRIDE, EXCLUSIVE)",
		"4915308": "Вызов (EXEC)",
		"688190": "Выполнение",
		"57738078": "Выполнение (авто)",
		"57738083": "Выполнение (ручная)",
		"4915350": "Выполнение программного кода (EVAL)",
		"1572972": "Выражения",
		"5275779": "Выход (RETURN)",
		"3538948": "Вычисляемые события",
		"1572872": "Группировка (GROUP)",
		"2719887": "Группы свойств и действий",
		"688153": "Действия",
		"1310742": "Дизайн навигатора",
		"57737883": "Дизайн отчетов",
		"29884443": "Дизайн формы",
		"5472308": "Добавление объектов (NEW)",
		"60555482": "Журналы и логи",
		"2719794": "Заголовок модуля",
		"36601888": "Запись файла (WRITE)",
		"5832722": "Запрос значения (REQUEST)",
		"1573053": "Идентификаторы",
		"2720036": "Идентификация элементов",
		"5472310": "Изменение класса (CHANGECLASS, DELETE)",
		"5472305": "Изменение свойства (CHANGE)",
		"5275761": "Изменение состояния",
		"46367369": "Изучить",
		"35521066": "Именование",
		"36601927": "Импорт данных (IMPORT)",
		"688177": "Индексы",
		"2228688": "Инструкции",
		"5275804": "Инструкция +=",
		"6160446": "Инструкция <- WHEN",
		"2228671": "Инструкция =",
		"6422580": "Инструкция =>",
		"4391125": "Инструкция @",
		"43647165": "Инструкция ACTION",
		"43647187": "Инструкция ACTION+",
		"27689167": "Инструкция AFTER",
		"27689164": "Инструкция BEFORE",
		"2228512": "Инструкция CLASS",
		"6422561": "Инструкция CONSTRAINT",
		"4718609": "Инструкция DESIGN",
		"27689238": "Инструкция EXTEND CLASS",
		"32474671": "Инструкция EXTEND FORM",
		"3670145": "Инструкция FORM",
		"3670064": "Инструкция GROUP",
		"4391024": "Инструкция INDEX",
		"4391104": "Инструкция META",
		"3670029": "Инструкция NAVIGATOR",
		"6160402": "Инструкция ON",
		"4391012": "Инструкция TABLE",
		"6160437": "Инструкция WHEN",
		"3670087": "Инструкция WINDOW",
		"29884429": "Интеграция",
		"1573071": "Интерактивное представление",
		"34996245": "Интернационализация",
		"60555474": "Интерпретатор",
		"1310754": "Классификация (IS/AS)",
		"2031628": "Классы",
		"1572881": "Композиция (JOIN)",
		"1572883": "Константа",
		"4391159": "Лексемы",
		"35521071": "Литералы",
		"688147": "Логика предметной области",
		"688149": "Логика представлений",
		"688137": "Логическая модель",
		"4391033": "Логические операторы (AND, OR, NOT, XOR)",
		"35520998": "Материализации",
		"1310740": "Метапрограммирование",
		"8945688": "Миграция",
		"1146882": "Модули",
		"688188": "Модульность",
		"60555476": "Монитор процессов",
		"688163": "Навигатор",
		"43647517": "Обработка исключений (TRY)",
		"51216539": "Обращение из внешней системы",
		"51216545": "Обращение из внутренней системы",
		"51216541": "Обращение к внешней системе (EXTERNAL)",
		"51216543": "Обращение к внутренней системе (INTERNAL, FORMULA)",
		"3538950": "Ограничения",
		"46367376": "Онлайн демо",
		"3866734": "Оператоpы",
		"4915315": "Оператор  EXEC",
		"5832850": "Оператор ABSTRACT",
		"32474694": "Оператор ABSTRACT (д)",
		"34439184": "Оператор ACTIVATE",
		"34439178": "Оператор ACTIVE FORM",
		"34439170": "Оператор ACTIVE TAB",
		"52429385": "Оператор AGGR",
		"34439583": "Оператор APPLY",
		"43647290": "Оператор ASK",
		"6422546": "Оператор BREAK",
		"34996257": "Оператор CANCEL",
		"5832845": "Оператор CASE",
		"34439461": "Оператор CASE (д)",
		"6422585": "Оператор CHANGE",
		"6684681": "Оператор CHANGECLASS",
		"34439525": "Оператор CLASS",
		"14057488": "Оператор CONCAT",
		"4390937": "Оператор DATA",
		"6684683": "Оператор DELETE",
		"36601995": "Оператор DIALOG",
		"6684756": "Оператор EMAIL",
		"4915357": "Оператор EVAL",
		"34439450": "Оператор EXCLUSIVE",
		"43647275": "Оператор EXPORT",
		"48758827": "Оператор EXTERNAL",
		"6684675": "Оператор FOR",
		"5832838": "Оператор FORMULA",
		"5832781": "Оператор GROUP",
		"34439432": "Оператор IF",
		"34439477": "Оператор IF ... THEN",
		"6422575": "Оператор IF ... THEN (д)",
		"31260959": "Оператор IMPORT",
		"35520985": "Оператор INPUT",
		"6684742": "Оператор INTERNAL",
		"7208987": "Оператор JOIN",
		"34439483": "Оператор MAX",
		"4915332": "Оператор MESSAGE",
		"34439486": "Оператор MIN",
		"30179337": "Оператор MULTI",
		"34439469": "Оператор MULTI (д)",
		"34439224": "Оператор NESTEDSESSION",
		"6684676": "Оператор NEW",
		"34439187": "Оператор NEWEXECUTOR",
		"34439219": "Оператор NEWSESSION",
		"31260689": "Оператор NEWTHREAD",
		"30179339": "Оператор OVERRIDE",
		"5832883": "Оператор PARTITION",
		"6684689": "Оператор PREV",
		"43647273": "Оператор PRINT",
		"31916126": "Оператор READ",
		"6160392": "Оператор RECURSION",
		"6684781": "Оператор REQUEST",
		"6422559": "Оператор RETURN",
		"34439613": "Оператор SEEK",
		"6684788": "Оператор SHOW",
		"7012362": "Оператор STRUCT",
		"34439577": "Оператор TRY",
		"35520672": "Оператор UNGROUP",
		"6684721": "Оператор WHILE",
		"34439654": "Оператор WRITE",
		"7012366": "Оператор []",
		"5275731": "Оператор {...}",
		"13860867": "Оператор преобразования типа",
		"3866732": "Операторы",
		"14188561": "Операторы AND, OR, NOT, XOR",
		"4390973": "Операторы IS, AS",
		"34439422": "Операторы групп объектов",
		"6684691": "Операторы изменений",
		"5832715": "Операторы изменений (SET, CHANGED, ...)",
		"32474727": "Операторы сравнения",
		"1572901": "Операторы сравнения (=, >, <, ...)",
		"5832717": "Операторы формы",
		"36307157": "Операторы-действия",
		"36307155": "Операторы-свойства",
		"35520946": "Операции с группами объектов",
		"6684700": "Операции с классами",
		"4391029": "Операции с множествами",
		"4391041": "Операции с примитивами",
		"1572909": "Операции со структурами (STRUCT, [])",
		"7798789": "Опции действия",
		"7798786": "Опции свойства",
		"3014672": "Открытие формы",
		"5832739": "Отмена изменений (CANCEL)",
		"35520938": "Отображение (VIEW)",
		"5636122": "Отправка почты (EMAIL)",
		"5472299": "Парадигма",
		"65241244": "Параметры запуска",
		"60555468": "Параметры работы",
		"688168": "Первичные свойства (DATA)",
		"1573073": "Печатное представление",
		"60555472": "Планировщик",
		"3014689": "Поиск",
		"5832724": "Поиск (SEEK)",
		"4915326": "Показ сообщения (MESSAGE, ASK)",
		"60555484": "Политика безопасности",
		"73891841": "Политика оформления кода",
		"1572907": "Пользовательская формула (FORMULA)",
		"2228341": "Пользовательские классы",
		"60555470": "Пользовательский интерфейс",
		"5832731": "Порядок (ORDER)",
		"5275759": "Порядок выполнения",
		"5275710": "Последовательность ({...})",
		"29884425": "Представления формы",
		"5832713": "Предыдущее значение (PREV)",
		"13860869": "Преобразование типа",
		"5275777": "Прерывание (BREAK)",
		"5832735": "Применение изменений (APPLY)",
		"2228236": "Примеры",
		"1572994": "Приоритет операторов",
		"2719763": "Проекты",
		"4161549": "Простые ограничения",
		"3538946": "Простые события",
		"60555478": "Профайлер",
		"3670155": "Пустая инструкция",
		"35520764": "Работа с файлами",
		"1572874": "Разбиение / Упорядочивание (PARTITION ... ORDER)",
		"4391059": "Разработка",
		"57738076": "Разработка (авто)",
		"57738081": "Разработка (ручная)",
		"4391038": "Распределение (UNGROUP)",
		"1146899": "Расширение действий",
		"1146890": "Расширение классов",
		"1146897": "Расширение свойств",
		"1146901": "Расширение форм",
		"1146886": "Расширения",
		"5275772": "Рекурсивный цикл (WHILE)",
		"1572876": "Рекурсия (RECURSION)",
		"60555507": "Ручная установка",
		"688151": "Свойства",
		"2719863": "Сессии изменений",
		"6684704": "Сигнатура свойства (CLASS)",
		"65241355": "Системные параметры",
		"688155": "События",
		"65241264": "События запуска",
		"5636111": "События формы",
		"36601912": "Создание потоков (NEWTHREAD, NEWEXECUTOR)",
		"30769225": "Создание сессий (NEWSESSION, NESTEDSESSION)",
		"3014726": "Статические объекты",
		"29884533": "Статичное представление",
		"5275651": "Строковые операторы (+, CONCAT, SUBSTRING)",
		"1573069": "Структура формы",
		"29884537": "Структурированное представление",
		"688175": "Таблицы",
		"2228240": "Турнирная таблица",
		"60555466": "Управление",
		"2228636": "Управление материальными потоками",
		"30769221": "Управление сессиями",
		"35520952": "Управление фокусом",
		"18645035": "Установить",
		"688139": "Физическая модель",
		"5832729": "Фильтр (FILTER)",
		"688161": "Формы",
		"5275768": "Цикл (FOR)",
		"60555480": "Чат",
		"36601886": "Чтение файла (READ)",
		"46367644": "Экспорт данных (EXPORT)",
		"36307108": "Экстремумы (MAX, MIN)",
		"1573050": "Язык"
	}
	return titles_by_id	

def main(argv):
	restore(sys.argv[1], sys.argv[2])

if __name__ == "__main__":
   main(sys.argv[1:])	